Revit 2026 API

# SolidGlass Class

---

A static class that provides access to the property names that appear in the SolidGlass visual asset schema.

SystemObject Autodesk.Revit.DB.VisualSolidGlass

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SolidGlass
```
```vb
Public NotInheritable Class SolidGlass
```
```cpp
public ref class SolidGlass abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SolidGlass = class end
```

The SolidGlass type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "SolidGlass" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "SolidGlass" schema. |
|  | SolidglassBumpAmount | The property labeled "Amount" from the "SolidGlass" schema. |
|  | SolidglassBumpEnable | The property labeled "Type" from the "SolidGlass" schema. |
|  | SolidglassBumpMap | The property labeled "Image" from the "SolidGlass" schema. |
|  | SolidglassColorByObject | The property labeled "Custom Color" from the "SolidGlass" schema. |
|  | SolidglassGlossiness | The property labeled "Roughness" from the "SolidGlass" schema. |
|  | SolidglassReflectance | The property labeled "Reflectance" from the "SolidGlass" schema. |
|  | SolidglassRefractionIor | The property labeled "Refraction" from the "SolidGlass" schema. |
|  | SolidglassTransmittance | The property labeled "Color" from the "SolidGlass" schema. |
|  | SolidglassTransmittanceCustomColor | The property labeled "Custom Color" from the "SolidGlass" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace